from enum import IntEnum, auto


class HanziStructure(IntEnum):
    """
    汉字结构枚举，用于描述汉字的结构
    """
    独体 = 0
    左右 = auto()
    左中右 = auto()
    上下 = auto()
    上中下 = auto()
    右上包围 = auto()
    左上包围 = auto()
    左下包围 = auto()
    上三包围 = auto()
    下三包围 = auto()
    左三包围 = auto()
    全包围 = auto()
    镶嵌 = auto()
    品字 = auto()
    组合 = auto()


pianpang = '亻長八殳糸爪谷雨黄弓骨甘艹白車门凵辰氏匚辶母夂聿黽广尣冂竹冫虍金止皮臼卝亅用血韋乙巾犭刀尸瓦行虫灬舟色鼠酉牛囗龍尢彳豕香馬车' \
           '大鬼言魚欠冖而采身鹵讠页至辵牜卤厶饣里肀长兀艮鬥彡面丿禾弋玄厂一日衤克己覀纟十亠麥韦支廴羽比赤米豸戈斗爿疒見夕生非麻巳丶口釒黹' \
           '耂已卩几刂火攵首齒田旡土匕二山臣麦氵音屮鳥鼓斤鬲攴艸貝癶鬯豆舌先齿乚石龙走爻韭齊毛犬瓜耳女心罒衣靣高皿鸟业邑矛忄无曰足月镸入疋耒' \
           '革頁龠扌工气阜礻示彐厄毋歹手宀缶青鼻黑彑木風丨飞歺穴髟马玉卜立隶文儿阝矢自又羊黍贝片干力方勹廾父钅飠户人乛子小风士角鹿匸饣丬牙目' \
           '巛鱼鼎齐隹丷川见靑水肉寸幺辛爫門糹王'


